//структури от данни - видове начини на представяне на данните
//добавяне на елемент към масив (по сложно е с масив, сложността се намаля при използване на свързан списък)
//структури от данни, свойства, сложности на имплементациите на структурите от данни, оптимизация
//масив, списък, стек(LIFO), опашка(FIFO), дървета, графи???, хеш таблици(речник), множества(хеш)

#include <iostream>
using namespace std;

int main()
{
    int n;
    cin >> n;

    int* arr = new int[n];

    for(int i = 0; i < n; i++)
    {
        cin >> arr[i];
    }

    for(int i = 0; i < n; i++)
    {
        for(int j = 0; j < n - i - 1; j++)
        {
            if(arr[j] > arr[j + 1])
            {
                int helper = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = helper;
            }
        }
    }

    return 0;
}